# IsCriticalPath Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkSegmentData..::..IsCriticalPath Property
MEPNetworkSegmentData Class See Also
---
Verifies if the segment is on the critical path.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool IsCriticalPath { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsCriticalPath As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsCriticalPath {
	bool get ();
}
```

# See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace